ProgessBase/Documents/ПРГ_ДвижениеДокументовАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_ДвижениеДокументовАрхива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПРГ_ДокументыАрхиваМестоположение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_ВидыДвиженияДокументовАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыАрхива</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГ_ДокументыАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местоположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПРГ_МестоположениеДокументовАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ПРГ_ДокументыАрхиваМестоположение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПРГ_ДокументыАрхиваМестоположение</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоположениеДокументаАрхива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_МестоположениеДокументовАрхива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументАрхива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ДокументыАрхива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Documents/ПРГ_ДвижениеДокументовАрхива/Ext/ObjectModule.bsl
//Blik 211113
// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;

КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПРГ_ДокументыАрхиваМестоположение.Записывать = Истина;
	Движения.ПРГ_ДокументыАрхиваМестоположение.Очистить();
	Для Каждого ТекСтрокаДокументыАрхива Из ДокументыАрхива Цикл
		Движение = Движения.ПРГ_ДокументыАрхиваМестоположение.Добавить();
		Движение.Период = Дата;
		Движение.ДокументАрхива = ТекСтрокаДокументыАрхива.Документ;
		Движение.МестоположениеДокументаАрхива = ТекСтрокаДокументыАрхива.Местоположение;
		
		//установить местоположение в справочнике
		
		
	КонецЦикла;

	
КонецПроцедуры
